In [1]:
import pandas as pd
import numpy as np

In [20]:
df = pd.DataFrame ({
    'key1' : list('aabba'),
    'key2' : ['guitar','cello','guitar','cello','guitar'],
    'data1' : np.random.randn(5) * 20,
    'data2' : np.random.randn(5) * 10 +10})
df

  key1    key2      data1      data2
0    a  guitar   4.918604   0.099571
1    a   cello -21.803452   1.781295
2    b  guitar  17.206581   5.521557
3    b   cello  19.096417  15.450491
4    a  guitar  11.783640   1.462547

# Group by

In [21]:
grouped = df.groupby('key1')
grouped

In [22]:
grouped.mean() #Obtengo la media de las columnas agrupadas por la columna key1

          data1      data2
key1
a     -1.700403   1.114471
b     18.151499  10.486024

In [23]:
grouped.std()

          data1     data2
key1
a     17.744904  0.893262
b      1.336316  7.020816

In [24]:
grouped.count()

      key2  data1  data2
key1
a        3      3      3
b        2      2      2

In [25]:
combined_means = df.groupby(['key1', 'key2']).mean() #Lo agrupo por key1 y key2 y saco las medias 
combined_means

                 data1      data2
key1 key2
a    cello  -21.803452   1.781295
     guitar   8.351122   0.781059
b    cello   19.096417  15.450491
     guitar  17.206581   5.521557

In [26]:
combined_means.index #De esta manera puedo ver los index de mi df

MultiIndex(levels=[['a', 'b'], ['cello', 'guitar']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [28]:
combined_means.loc[('a','cello')] #Obtengo los datos de las columnas data1 y data2 de filas a,cello

data1   -21.803452
data2     1.781295
Name: (a, cello), dtype: float64

In [29]:
df #Pero el df no me cambia

  key1    key2      data1      data2
0    a  guitar   4.918604   0.099571
1    a   cello -21.803452   1.781295
2    b  guitar  17.206581   5.521557
3    b   cello  19.096417  15.450491
4    a  guitar  11.783640   1.462547

In [31]:
means = df.groupby('key1').mean()
means

          data1      data2
key1
a     -1.700403   1.114471
b     18.151499  10.486024

In [33]:
#Con merge, lo que hago es crear dos columnas nuevas que cumplan con esas condiciones
df.merge(means, left_on = 'key1', right_index = True, suffixes =('','_mean'))

  key1    key2      data1      data2  data1_mean  data2_mean
0    a  guitar   4.918604   0.099571   -1.700403    1.114471
1    a   cello -21.803452   1.781295   -1.700403    1.114471
4    a  guitar  11.783640   1.462547   -1.700403    1.114471
2    b  guitar  17.206581   5.521557   18.151499   10.486024
3    b   cello  19.096417  15.450491   18.151499   10.486024

In [34]:
df

  key1    key2      data1      data2
0    a  guitar   4.918604   0.099571
1    a   cello -21.803452   1.781295
2    b  guitar  17.206581   5.521557
3    b   cello  19.096417  15.450491
4    a  guitar  11.783640   1.462547

### Inteating over objects

In [35]:
grouped

In [38]:
for group in grouped:
    print(type(group))

<class 'tuple'>
<class 'tuple'>

In [39]:
for key, data in grouped:
    print(key)
    print(data)

a
  key1    key2      data1     data2
0    a  guitar   4.918604  0.099571
1    a   cello -21.803452  1.781295
4    a  guitar  11.783640  1.462547
b
  key1    key2      data1      data2
2    b  guitar  17.206581   5.521557
3    b   cello  19.096417  15.450491

In [41]:
df.groupby(df['key2']).mean()

            data1     data2
key2
cello   -1.353518  8.615893
guitar  11.302941  2.361225

In [42]:
df

  key1    key2      data1      data2
0    a  guitar   4.918604   0.099571
1    a   cello -21.803452   1.781295
2    b  guitar  17.206581   5.521557
3    b   cello  19.096417  15.450491
4    a  guitar  11.783640   1.462547

In [43]:
df.groupby(df['data1'] > 0).mean()

           data1     data2
data1
False -21.803452  1.781295
True   13.251310  5.633542

In [44]:
import random

random.seed(42)
zoo = pd.DataFrame({
    'animal' : random.choices(['mouse', 'mantis', 'giraffes', 'gophers'], k=20),
    'number' : [ random.randint(3,67) for _ in range(20)]})

zoo

      animal  number
0   giraffes      23
1      mouse      57
2     mantis      46
3      mouse      38
4   giraffes      22
5   giraffes      30
6    gophers      46
7      mouse      16
8     mantis      14
9      mouse      51
10     mouse      15
11  giraffes      48
12     mouse      47
13     mouse      36
14  giraffes       8
15  giraffes      61
16     mouse      18
17  giraffes      51
18   gophers      13
19     mouse      40

In [48]:
zoo.groupby('animal').sum()

          number
animal
giraffes     243
gophers       59
mantis        60
mouse        318

In [49]:
zoo['animal'].str[0]

0     g
1     m
2     m
3     m
4     g
5     g
6     g
7     m
8     m
9     m
10    m
11    g
12    m
13    m
14    g
15    g
16    m
17    g
18    g
19    m
Name: animal, dtype: object

In [50]:
zoo.groupby(zoo['animal'].str[0]).sum()

        number
animal
g          302
m          378

### Selecting a column or subset of columns

In [51]:
df.groupby('key2')['data1'].mean()

key2
cello     -1.353518
guitar    11.302941
Name: data1, dtype: float64

### Data aggregation

In [53]:
(grouped.quantile(.1))

0.1       data1     data2
key1
a    -16.459041  0.372167
b     17.395564  6.514451

In [56]:
def peak_to_peak(series):
    return series.max() - series.min()

grouped['data1'].apply(peak_to_peak) #Esta es la manera en que puedo aplicar una funcion sobre una columna

key1
a    33.587092
b     1.889836
Name: data1, dtype: float64

### Column-wise and multiple function application

In [59]:
import wget

ModuleNotFoundError: No module named 'wget'

In [58]:
url = "https://raw.githubusercontent.com/wesm/pydata-book/1st-edition/ch08/tips.csv"
url

'https://raw.githubusercontent.com/wesm/pydata-book/1st-edition/ch08/tips.csv'